# Part 2

# Topics 
# 1) StringIO
# 2) Pandas read_csv

In [3]:
import pandas as pd
df=pd.read_csv("data1.csv")
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [5]:
type(df)

pandas.core.frame.DataFrame

In [10]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,56,g')

In [11]:
type(data)

str

In [15]:
#How to convert str data into file memory format data 
from io import StringIO

In [17]:
#in memory file format object
StringIO(data)

CSV --> need File Format data to read and in 
Csv there are value Coma seprated like we genrated in str 
So here StringIO came in picture to change the type of 
data io.StringIO (in memory file Format) which req to 
read csv file

In [19]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    1
1    a    b    2
2    c   56    g

# Parameters in File Read function

# @ 1 usecols=['','']

In [ ]:
pd.read_csv() #shift+tab btn

In [32]:
pd.read_csv(StringIO(data),usecols=['col1','col2']) #use ANY COL

  col1 col2
0    x    y
1    a    b
2    c   56

In [38]:
import pandas as pd
df=pd.read_csv("data1.csv",usecols=['satisfaction_level','last_evaluation','number_project','time_spend_company','average_montly_hours','promotion_last_5years'])
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,promotion_last_5years
0,0.38,0.53,2,157,3,0
1,0.80,0.86,5,262,6,0
2,0.11,0.88,7,272,4,0
3,0.72,0.87,5,223,5,0
4,0.37,0.52,2,159,3,0

I have changed the data according to the col I want

In [40]:
df.to_csv('Changed.csv')

Here We saved this changed file to dir

# @2 Index

In [47]:
df.to_csv('changed.csv' ,index=False) # index will be removed

In [61]:
sample=('col1,col2,col3,col4\n'
     '1,2,1\n'
     '2,,7,3\n'
     '566,56,6')

In [67]:
df=pd.read_csv(StringIO(sample))

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    2 non-null      float64
 2   col3    3 non-null      int64
 3   col4    1 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 228.0 bytes

In [ ]:
# changing data type

In [71]:
df=pd.read_csv(StringIO(sample),dtype='object') #changed to objects
# objects means string

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    2 non-null      object
 2   col3    3 non-null      object
 3   col4    1 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [75]:
df.head()

  col1 col2 col3 col4
0    1    2    1  NaN
1    2  NaN    7    3
2  566   56    6  NaN

In [77]:
df.isnull().sum()

col1    0
col2    1
col3    0
col4    2
dtype: int64

In [81]:
df['col3']

0    1
1    7
2    6
Name: col3, dtype: object

In [87]:
df['col2'][1]

nan

In [99]:
datatype=('col1,col2,col3,col4\n'
     '1,2,1\n'
     '2,7,3\n'
     '566,56,6')

In [ ]:
#how to change datatype of single elements
1) do this witrh dictionary

In [103]:
df=pd.read_csv(StringIO(datatype),dtype={'col1':int,'col2':float,'col3':int})

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int32
 1   col2    2 non-null      float64
 2   col3    3 non-null      int32
 3   col4    1 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 204.0 bytes